lessons = [
    {
        "number": 1,
        "title": 'print(), input(), int(input()) - что и как',
        'lessons': [
            {
                'num': 1,
                'type': 'text',
                'text': 'Выводит переданные аргументы на экран. Принимает один или несколько объектов для вывода. Выводом можно управлять с помощью необязательных аргументов sep, end, file и flush.<hr><h5>Вызов print 🎀</h5>Для вызова print нужно использовать скобки, как и для любой другой функции. Как правило, первая программа на Python для каждого программиста и есть вызов функции print с одним аргументом — строкой ”Привет, мир!”'
            },
            {
                'num': 2,
                'type': 'text',
                'text': 'input() - это ввод'
            },
            {
                'num': 3,
                'type': 'question',
                'text': 'Какая функция отвечает за вывод?',
                'answer': [
                    {
                        "text": 'print',
                        'is_true': True
                    },
                    {
                        "text": 'input',
                        'is_true': False
                    },
                    {
                        "text": 'vvod',
                        'is_true': False
                    }
                ]
            },
            {
                'num': 4,
                'type': 'code',
                'text': 'Выведите на экран "Hello, world!"',
                'io_data': [
                    {
                        "input": '',
                        'output': 'Hello, world!'
                    }
                ],
            },
            {
                'num': 5,
                'type': 'code',
                'text': 'Вводиться число. Найдите его квадрат.',
                'io_data': [
                    {
                        "input": '2',
                        'output': '4'
                    },
                    {
                        "input": '3',
                        'output': '9'
                    },
                ],
            },
        ]
    },
    {
        "number": 2,
        "title": 'Переменные - что и как',
        'lessons': [
            {
                'num': 1,
                'type': 'text',
                'text': 'print() - это вывод.'
            },
            {
                'num': 2,
                'type': 'text',
                'text': 'input() - это ввод'
            },
            {
                'num': 3,
                'type': 'question',
                'text': 'Какая функция отвечает за вывод?',
                'answer': 'print'
            },
            {
                'num': 4,
                'type': 'code',
                'text': 'Выведите на экран "Hello, world!"',
                'answer': 'Hello, world!',
            },
        ]
    },

]